class_name intro_story

extends Resource


var dialogue := {
	0 : {
		"type": "line",
		"text": "Больше тысячи лет назад случился \"Раскол\"... Катаклизм неясной природы, после которого человечество оказалось рассеянным по планетам Галактики, изолированным и разобщенным. Не осталось достоверных данных о том, каким было человечество до Раскола, о причинах катаклизма и как он происходил. Остались только мифы о золотом веке людей, называемом Полуднем, и мифов о якобы единой родине людей - планете под названием Грязь.",
		"sound": 0,
		"next_key": 1
	},
	1 : {
		"type": "line",
		"text": "На долгие семьсот лет Галактика, и люди в ней погрузились в хаос и тьму. Но 273 года назад несколько планет образовали Лигу, союз планет в основе которого лежат принципы свободы, равенства, мира и прогресса. Заново открытые планеты принимаются в этот союз, если сами жители  планет этого желают и если общество на этих планетах не утратило технологии космических перелетов.",
		"sound": 1,
		"next_key": 2
	},
	2 : {
		"type": "line",
		"text": "С планетами, которые не захотели вступить в Лигу и с планетами, которые сильно деградировали поддерживаются экономические и культурные контакты через аванпосты в надежде, что рано или поздно они присоединятся к остальному человечеству. Спустя тысячу лет изоляции и упадка новое объединение планет под названием Галактическая Лига Человечества или просто Лига пытается вновь сделать жизнь в Галактике безопасной и комфортной для созидания.",
		"sound": 2,
		"next_key": 3
	},
	3 : {
		"type": "line",
		"text": "Для этих целей был создан Корпус Рейнджеров. Это организация, состоящая из мужчин и женщин со всех планет союза, которые самоотверженно служат делу развития человечества, исследованию новых горизонтов, поддержания законности, порядка и правосудия для всех жителей Галактики. Их ежедневная тяжелая работа отражена в девизе: \"В глубинах космоса бесстрашные Рейнджеры на страже мира и порядка!\"",
		"sound": 3,
		"next_key": -1
	}
	
}
